test/tests/multiapps/warm_plate_par/buoyantCavity/0/phi
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |
  \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
   \\    /   O peration     | Website:  https://openfoam.org
    \\  /    A nd           | Version:  10
     \\/     M anipulation  |
\*---------------------------------------------------------------------------*/
FoamFile
{
    format      ascii;
    class       surfaceScalarField;
    location    "0";
    object      phi;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [1 0 -1 0 0 0 0];

internalField   nonuniform List<scalar>
2015
(
0.0193502747274452
0
0.0193502747274452
0
0.0193502747274452
0
0.0193502747274452
0
...
)
;

boundaryField
{
    left_back
    {
        type            calculated;
        value           uniform 0;
    }
    left_bottom
    {
        type            calculated;
        value           uniform 0;
    }
    left_left
    {
        type            calculated;
        value           uniform 0;
    }
    left_front
    {
        type            calculated;
        value           uniform 0;
    }
    left_top
    {
        type            calculated;
        value           uniform 0;
    }
    int_back
    {
        type            calculated;
        value           uniform 0;
    }
    int_bottom
    {
        type            calculated;
        value           uniform 0;
    }
    int_front
    {
        type            calculated;
        value           uniform 0;
    }
    int_top
    {
        type            calculated;
        value           uniform 0;
    }
    right_back
    {
        type            calculated;
        value           uniform 0;
    }
    right_bottom
    {
        type            calculated;
        value           uniform 0;
    }
    right_front
    {
        type            calculated;
        value           uniform 0;
    }
    right_right
    {
        type            calculated;
        value           uniform 0;
    }
    right_top
    {
        type            calculated;
        value           uniform 0;
    }
}


// ************************************************************************* //
